Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: I prefer drinking coffee to drinking tea.
jbo: lo nu pinxe loi ckafi ku lo nu pinxe loi tcati ku pukyzma mi

source: I thought Tom and Mary were crazy.
jbo: mi pu jinvi lo nu la tom je la meris cu fenki

source: I thought Tom was a doctor.
jbo: mi pu pensi lo nu la tom cu mikce prenu

source: I thought you'd be proud of me.
jbo: mi pu jinvi lo du'u do tu'a mi jgira

source: I thought you'd gone to Boston.
jbo: mi pu jinvi lo du'u do pu klama la .bastn.

source: Where did that ship come from?
jbo: ta poi bloti cu klama fi ma

source: This is a picture of the ship I was on.
jbo: ti pixra le bloti be mi

source: Tom was born on a ship.
jbo: la .tam. jbena fo lo bloti

source: Who's the captain of this ship?
jbo: ma bloja'a ti poi bloti

source: I have a right to be on this ship.
jbo: mi se terzi'e lo nu se bloti

source: The ship wasn't ready for battle.
jbo: le bloti na bredi lo nunda'a

source: Where is the captain of this ship?
jbo: le bloja'a be ti poi bloti ku ma zvati

source: You were told to stay on the ship.
jbo: minde do lo nu stali le bloti

source: How many people were aboard that ship?
jbo: ta bloti xo lo prenu

source: Is Tom still the captain of your ship?
jbo: xu la .tam. ca'o bloja'a le do bloti

source: They were told to stay on the ship.
jbo: minde ko'a lo nu stali le bloti

source: We were told to stay on the ship.
jbo: minde mi'a lo nu stali le bloti

source: I've just gotten home.
jbo: mi ziba'o zdani klama

source: I've just come home.
jbo: mi ziba'o zdani klama

source: My father is taking a walk in the park.
jbo: le mi patfu ca'o cadzu le panka

source: She says she's not dating anyone now, but I don't believe her.
jbo: ko'a cusku lo du'u pampe'o noda .ianai

source: They swam.
jbo: ko'a pu limna

source: We drank a lot.
jbo: mi'a mutce xalpinxe

source: Where is my newspaper?
jbo: lo mi plekarni ma zvati

source: Are you ready for Halloween?
jbo: xu do bredi la'oi halloween

source: I really just want to make friends.
jbo: mi djica lo nu penbi'o

source: I don't need this book.
jbo: mi na nitcu ti poi cukta

source: I don't introduce them.
jbo: mi na pengau

source: One good sentence is better than two bad.
jbo: pa lo xamgu jufra ku re lo xlali jufra ku xauzma

source: That's actually really mean.
jbo: je'u mutce cnixai

source: We're always complaining.
jbo: ba'u mi'o ze'e ba'urdu'u

source: What the hell did he do?
jbo: .o'onai ko'a pu mo

source: This is pretty accurate.
jbo: milxe drani

source: There wasn't any cat there.
jbo: noda poi mlatu va zvati

source: Did you walk down?
jbo: xu do mo'ini'a cadzu

source: Tamy discovered a mistake in the sentence structure.
jbo: la .tamis. facki lo cfila be le jufra

source: It looks like a Michelangelo painting.
jbo: simlu lo ka se pirlarfi'i be la .mikelAnjelos.

source: The streetlight over there is broken.
jbo: ta poi lajdictergu'i cu spofu

source: Lunch is ready!
jbo: dormijysai

source: I showed my room to her.
jbo: mi jarco le mi kumfa ku ko'a

source: Where is he going?
jbo: ca'o klama ma

source: Would you like that?
jbo: do ba se pluka xu

source: Would he like that?
jbo: ko'a ba se pluka xu

source: Would she like that?
jbo: ko'a ba se pluka xu

source: He wants an iPad mini.
jbo: ko'a djica tu'a lo me la .ipadminis.

source: She wants a fourth generation iPad.
jbo: ko'a djica tu'a lo me la .ipad. be do'e li vo

source: I like snow. It's so beautiful!
jbo: mi nelci loi snime .imu'ibo .u'e ri melbi

source: I like cats. They're so beautiful!
jbo: mi nelci lo mlatu .imu'ibo .u'e ri melbi

source: I like her. She's so beautiful!
jbo: mi nelci ko'a .imu'ibo .u'e ko'a melbi

source: He put a sudden end to this career as a poet.
jbo: suksa sisti lo za'i pemfi'i se jibri

source: More coffee? No, thanks.
jbo: cusku lu .aupei ckafi li'u .i cusku lu .aunai ki'u li'u

source: It's my son.
jbo: bersa mi

source: The tiger escaped from the zoo.
jbo: le tirxu pu pifli'a le mivdalmuzga

source: One of the tigers has escaped from the zoo.
jbo: pa lo tirxu pu pifli'a le mivdalmuzga

source: I told you Tom isn't my friend.
jbo: mi do pu jungau lo du'u la .tam. mi na'e pendo

source: I don't have a girlfriend.
jbo: mi no da se ke fetsi pampendo

source: What're you going to do on Friday?
jbo: do mo ca le mumdei

source: Don't repeat that word in God's house.
jbo: .e'unaire'e ko na cusku le valsi ne'i lo malsi

source: Hurry up! We are waiting for you.
jbo: ko sutra .i mi'a denpa

source: What's the difference between American and British English?
jbo: lo merbau lo glibau cu frica ma

source: Little mistakes are like salt in a soup.
jbo: lo tolvai nunsrera cu simlu lo se stasu silna

source: You must be sad as you've lost one of your friends.
jbo: .uinaidai lo do pendo pu mrobi'o

source: You never know what life may throw your way.
jbo: ka'enai djuno lo du'u lo mivru'e cu mokau do

source: We are all capable of loving and being loved at the moment of our birth.
jbo: mi'a ka'e prami je se prami cazi lo nu jbena

source: It's a very dangerous system.
jbo: mutce ckape ciste

source: I would like to buy myself a new computer; show me the best model.
jbo: mi nu terve'u lo cnino skami kei djica .i ko lo selve'u poi xagrai cu jarco

source: The world changes a lot.
jbo: le terdi ze'ecaru'i binxo

source: Why all this hate?
jbo: xebni mu'i ma

source: I hate everyone, and everyone hates me.
jbo: mi roda xebni je se xebni

source: Listen to her!
jbo: ko ko'a jundi

source: That is useless to me.
jbo: ta tolplixau mi

source: I couldn't live like that.
jbo: mi pu kakne nai lo ka jmive tai

source: Grab that.
jbo: ko ta jgari

source: Grab Tom.
jbo: ko la .tam. jgari

source: Send in something to eat or I'll kill a hostage.
jbo: le'o go ko mrilu lo se citka ginai mi catra pa lo pinfu

source: Show me how to do that.
jbo: ko jarco tu'a lo tadji

source: Show me.
jbo: ko jarco

source: He is afraid of chopsticks.
jbo: terpa lo cticinza

source: I'm writing a sentence in German.
jbo: mi ciska lo jufra bau lo dotybau

source: Yerevan is the capital of Armenia.
jbo: la .ierevAn. cu raltca la .arminiys.

source: Did you want to cut off his head?
jbo: do sedycaugau xu djica

source: I kissed her on the forehead.
jbo: mi cinba ko'a lo mebri

source: Fishing was very important.
jbo: lo zu'o fipkalte cu mutce vajni

source: Large raindrops are starting to fall.
jbo: loi barda cavdirgo co'a farlu

source: Stop shooting.
jbo: ko celgunta sisti

source: The taste of the first kiss remains vivid in my memory.
jbo: le vrusi be le nu paroi cinba cu se morji mi

source: Tom always wears a hat.
jbo: la .tam. roroi se sedyta'u

source: Tom almost always wears a hat.
jbo: la .tam. piso'aroi se sedyta'u

source: Tom frequently wears a hat.
jbo: la .tam. piso'eroi se sedyta'u

source: Tom sometimes wears a hat.
jbo: la .tam. piso'iroi se sedyta'u

source: Tom rarely wears a hat.
jbo: la .tam. piso'oroi se sedyta'u

source: Tom almost never wears a hat.
jbo: la .tam. piso'uroi se sedyta'u

source: Tom doesn't always wear a hat.
jbo: la .tam. roroinai se sedyta'u

source: Tom's cooking was actually not so bad.
jbo: lo pu nu la .tom. cu jukpa kei ja'a na'e xlali

source: I don't have anywhere I need to be.
jbo: mi bilga lo nu zvati noda

source: He wants to come.
jbo: ko'a djica lo ka klama

source: There's something important I need to tell you.
jbo: da me lo vajni noi ei mi cusku fi do

source: I like to answer these kind of questions.
jbo: mi nelci lo ka spuda lo tai se reisku

source: I'm closing the door.
jbo: mi ca'o ga'orgau le vrogai

source: Good friends are like stars. You don't always see them, but you know they are always are there.
jbo: lo pendo lo tarci cu simsa lo ka roroi viska najeku'i zasti

source: Everything is okay in the end. If it's not okay, then it's not the end.
jbo: roda mulno jo xamgu

source: I have to buy flowers for my girlfriend.
jbo: mi terve'u .ei loi xrula fi'o se dunda le mi pampe'o

source: The dog is called Ken.
jbo: le gerku zo .ken. se cmene

source: I'm glad to have met you.
jbo: mi penmi .ui do

source: Two plus two equals five.
jbo: li re su'i re du li mu

source: Right now, I'm not hungry.
jbo: mi na ca xagji

source: The teapot broke.
jbo: le tcatypatxu pu pofybi'o

source: The teapot is whistling.
jbo: le tcatypatxu cu siclu

source: It has never been done before.
jbo: pu noroi

source: That's almost a shocking situation.
jbo: naru'e jenca

source: I have lived my life on the sea. I have been through many a storm. I know what it is to be within a step of death ay, nearer than a step.
jbo: mi xamsi se mivru'e .i mi so'iroi lifri lo nu lidvilti'a .i mi djuno lo su'u bazi morsi

source: How was your day today?
jbo: cabdei .oipei

source: The last house was Tom's residence.
jbo: le zdani poi romoi se xabju la .tam.

source: What a home! The place looked like some disused rag-store. The large unglazed window was closed up by a dilapidated shutter.
jbo: .u'e da goi ko'a zdani .i ko'a smimlu lo lumbu'u zaisle cai .i le barda je nalgusminra canko cu ganlo fi lo spofu

source: I am a slave to drink.
jbo: mi loi xalka cu selbapselfu

source: Drop the anchor!
jbo: ko falcru lo stagau

source: I washed my T-shirt.
jbo: mi le mi creka cu lumci

source: "How many candles did you blow out on your birthday?" "Fifty-six"
jbo: lu pau do fagystigau loi xo laktergu'i li'u lu muxa li'u

source: Either they don't want to or they can't.
jbo: na djica gi'onai na kakne

source: My tea is too sweet.
jbo: loi mi tcati cu dukse titla

source: I am this kid's companion.
jbo: mi kansa ti poi verba

source: It wasn't exactly a piece of cake.
jbo: pu to'e frili

source: I believe he is honest.
jbo: .iasai stace

source: I hope Tom is in a good mood.
jbo: .a'o la .tam. gleki

source: Good, right, yes.
jbo: go'i .i drani

source: "How is the young lady?" "She is greatly distressed; but her father is comforting her."
jbo: lu le nixli .oidaipei li'u lu ri goi ko'a mutce se raktu .iku'i le ri patfu cu drijdikygau li'u

source: Sam, no!
jbo: doi .sam. .e'unai

source: Oh, here comes Chris.
jbo: la .kris. vi klama

source: Good job, Captain Obvious.
jbo: li'anaidai xo'o doi sapyga'e

source: On your mark! Get set! Go!
jbo: ko barna cpana .i ko bredi .i ko klama

source: Hi, could you move? We're about to have a meeting here.
jbo: coi .i pe'u ko cliva .i zipu'o nunjmaji lu'omi'a

source: My friend is bilingual.
jbo: le mi pendo reda se bangu

source: This sentence is true.
jbo: nei

source: The following sentence is true. The preceding sentence is false.
jbo: go'o .i na go'i

source: Did somebody hit you?
jbo: da do darxi xu

source: Did he hit you?
jbo: ko'a do darxi xu

source: Did Tom hit you?
jbo: la .tam. do darxi xu

source: Don't ask any questions.
jbo: ko na spuda

source: You enjoyed that, didn't you?
jbo: do ta pukfri xuru'e

source: Can you speak Japanese?
jbo: xu do se ponbau

source: Mark's car is called "Thunder Giant".
jbo: le karce pe la .mark. lu lidfru bracrida li'u se cmene

source: I'm not sure where I should put this.
jbo: mi punji fi makau ju'ocu'i

source: I am thrilled to be here.
jbo: .o'unai.ui zvati

source: He's not himself.
jbo: ko'a ko'a na du

source: She's not herself.
jbo: ko'a ko'a na du

source: I'm not myself.
jbo: mi mi na du

source: Meet me there at midnight.
jbo: ko mi penmi ca lo ctemidju

source: Is it legal?
jbo: flalu xu

source: That boy speaking English is taller than me.
jbo: ta poi nanla gi'e se glibau ku'o mi clazma

source: Keisuke is taller than me.
jbo: la .keisukes. mi clazma

source: It looks like rain. We should close the windows.
jbo: carvi .i .e'u ga'orgau lo canko

source: The tiles that fell from the roof broke into very small pieces.
jbo: lo karda poi farlu fi le drudi cu porpi loi ve'i spisa

source: Tom wrote down his new teacher's name so he wouldn't forget it.
jbo: la .tam. ciksi lo cmene be le cnino ctuca mu'i lo nu morji

source: The journey was brief.
jbo: ze'i litru

source: Who is familiar with a book consisting of one page only?
jbo: ma se slabu lo cukta poi papri pa mei

source: I'm meeting him this evening.
jbo: mi ko'a penmi ca lo cabvanci

source: Who got married?
jbo: ma spebi'o

source: What a big surprise!
jbo: .uecai

source: I know why Tom is in trouble.
jbo: mi djuno lo du'u ki'u makau la .tam. se raktu

source: I wanted to see you too.
jbo: mi nu viska do kei djica ji'a

source: The train left the station and was soon out of sight.
jbo: le trene bazigi renytcana cliva gi na se viska

source: Since he's visited Rome many times, he knows it well.
jbo: ko'a so'iroi vitke la .romas. .iseki'ubo certu djuno fi ry.

source: The train had already left by the time I got to the station.
jbo: ba'o lo nu trene cliva ku mi le renytcana cu zvati

source: Without music, the world would be a boring place.
jbo: tolzdi secau lo zgike

source: The house standing on the hill is very old.
jbo: lo dinju poi se stuzi lo cmacmana cu mutce lo ka laldo

source: "One way or round trip?" "Um... let me think. Round trip."
jbo: pamei je'i remei farna - .yyy. remei

source: Is French your language?
jbo: xu do se frasybau

source: Do you agree about that?
jbo: .iepei

source: She doesn't want me to speak about this issue.
jbo: nu mi tavla fi ko'a kei toldjica

source: He asked for a glass of water.
jbo: ko'a cpedu lo djacu kabri

source: Today is one of my friends' birthday.
jbo: lo cabdei lo mi pendo cu terjbe

source: I care for no man on earth, and no man on earth cares for me.
jbo: mi noda poi prenu cu kurji soi vo'a

source: A googol is ten to the power of one hundred.
jbo: la'oi googol du li pano te'a panono

source: I want to marry this man.
jbo: mi nu spebi'o ti poi nanmu kei djica

source: You're afraid of him, aren't you?
jbo: do tu'a ko'a terpa xuru'e

source: The towel is wet.
jbo: le sudgaubu'u cu cilmo

source: What are you doing Sunday?
jbo: do mo ca le nondei

source: I'm sorry I told you.
jbo: .u'u mi do jungau

source: I've visited Kyoto twice.
jbo: mi reroi vitke la .kiotos.

source: I love dogs.
jbo: mi prami lo gerku

source: It was filmed in Australia.
jbo: kingau tu'i lo sralygu'e

source: The movie we saw last night was filmed in Australia.
jbo: lo skina poi mi'o kinzga ti'u lo prula'i ku'o cu se kingau tu'i lo sralygu'e

source: I got left behind.
jbo: mi pu se fesli'a

source: Was Tom left behind?
jbo: la .tam. se fesli'a xu

source: No one's getting left behind.
jbo: noda se fesli'a

source: We try our best.
jbo: mi'ai troci traji

source: I want to run.
jbo: mi djica lo ka bajra

source: They want peace.
jbo: za'u ko'a djica lo nu panpi

source: Tom wanted Mary.
jbo: la tom pu djica tu'a lo maris

source: We want to know.
jbo: mi'ai djica lo ka djuno

source: We want to talk.
jbo: mi'ai djica lo ka tavla

source: I don't want tea.
jbo: mi na djica tu'a lo tcati

source: I want that book.
jbo: mi djica tu'a lo va cukta

source: I wanted to be there.
jbo: mi pu djica lo ka zvati va

source: I wanted to help you.
jbo: mi pu djica lo ka sidju do

source: I wanted to hurt Tom.
jbo: mi pu djica lo ka jai xrani la tom

source: I wanted to kill Tom.
jbo: mi pu djica lo ka catra la tom

source: I wanted to love Tom.
jbo: mi pu djica lo ka prami la tom

source: I wanted to remember.
jbo: mi pu djica lo ka morji

source: I wanted to save Tom.
jbo: mi pu djica lo ka nurxrugau la tom

source: I wanted to stop Tom.
jbo: mi pu djica lo ka sisti tu'a la tom

source: I wanted to warn you.
jbo: mi pu djica lo ka jai kajde do

source: I wanted to warn Tom.
jbo: mi pu djica lo ka jai kajde la tom

source: I'd like some coffee.
jbo: mi djica tu'a lo ckafi

source: I don't want your opinion.
jbo: mi djica nai lo ka jinvi lo se jinvi be do

source: Tom wanted to talk to you.
jbo: la tom pu djica lo ka tavla do

source: I don't want to do anything.
jbo: mi djica lo ka zukte noda

source: Tom said you wanted to see me.
jbo: la .tom. cu cusku lo sedu'u do mi pendji

source: I just don't want to marry you.
jbo: sa'u mi na djica lo ka gau co'a speni do

source: Is that why you want to kill me?
jbo: xu mu'i makau do catra be mi djica

source: Is there anything you want to say?
jbo: pei do djica lo ka cusku da

source: I just want to know what's going on.
jbo: mi djica loka po'o djuno lo du'u ma ca'o fasnu

source: We don't want to cause any trouble.
jbo: mi na ra'urselja'edji

source: Tom's scared.
jbo: la .tam. terpa

source: Music can be defined as the art of producing emotion by the combination of sounds.
jbo: lo nu zgike cu ka'e se ciksi fo lo ka larcu lo ka cnigau se pi'o lo sance mixre

source: Where you are is not just your physical environment.
jbo: lo se zvati cu zmadu lo vanbi canlu

source: I lived in the US from 2008 till 2011.
jbo: .i mi pu xabju lo merko co'a li 2008 co'u li 2011

source: I want to talk to you about this list.
jbo: .au mi tavla do lo vi liste

source: I'll take you anywhere you want to go.
jbo: mi do xelklasabji zo'e poi do kladji ke'a

source: You probably don't want to talk to me.
jbo: do cu la'a na djica lo ka tavla mi

source: I don't want to lie to Tom.
jbo: mi la .tam. tcica .aunai

source: I have so many things I want you to know.
jbo: mi djica lo nu mi djuno so'i u'e da

source: You don't have to hang around if you don't want to.
jbo: do bilga jo djica lo ka zvati ti

source: Hopefully, I'll be given an expensive car or at least one that isn't broken.
jbo: .a'o mi te dunda lo kargu karce ja do'a nai lo karce poi na spofu

source: At least you didn't steal anything.
jbo: do'a nai do no da zekri lebna

source: It's generous of you to teach me some additional things.
jbo: do'adai do mi ctuca lo se jmina

source: What do you think we gonna do during the new semester?
jbo: mi'o gasnu ma pe'ipei ca lo cnino kulcitsi

source: How many minutes do you get if you change 48 hours into minutes?
jbo: lo cacra be li vobi du lo mentu be ma

source: I own all the books.
jbo: mi ponse ro le cukta

source: Those are happy, who forget everything.
jbo: lo morji be noda gleki

source: Forty-eight hours is how many minutes?
jbo: lo cacra be li vobi du lo mentu be ma

source: There is no breeze here.
jbo: vi bifcau

source: Health is all I want.
jbo: mi kanro .aupo'o

source: You look so happy.
jbo: do simlu lo ka gleki sai

source: I wish you happiness.
jbo: .au nu do gleki

source: Mary is beautiful.
jbo: la meris. cu melbi

source: You're a beautiful woman.
jbo: do melbi ninmu

source: Mary is a beautiful girl.
jbo: la meris. melbi nixli

source: Mary is a beautiful woman.
jbo: la meris. melbi ninmu

source: This is a beautiful house.
jbo: ti melbi zdani

source: These are beautiful horses.
jbo: ti melbi xirma

source: Mary has beautiful long hair.
jbo: la meris. melbi clani se kerfa

source: Mary has beautiful brown eyes.
jbo: la meris. melbi bunre se kanla

source: Mary is wearing a beautiful red dress.
jbo: la meris. cu dasni le melbi ke xunre pastu

source: What is the difference between the meaning of i'a and i'e?
jbo: ma te frica lo smuni be zo .i'a lo smuni be zo .i'e

source: Mary is a very busy woman.
jbo: la meris. cu mutce tolcando ninmu

source: Tom, be careful you don't fall in the hole.
jbo: doi tom ko jundi tezu'e lo nu na farlu lo kevna

source: It's not an exaggeration to state that he is a genius.
jbo: ba'unai ko'a mencre

source: He decided to go there.
jbo: ko'a klama jdice

source: Where is the fire extinguisher?
jbo: zvati ma fa lo fagri dicra tutci

source: I want to speak with you.
jbo: .au mi tavla do

source: I have to learn how to shoot.
jbo: ei mi cilre fi lo du'u ta'i lo ka ce'u cecla

source: She continued working.
jbo: ko'a pu ca'o gunka

source: My friend is stupid.
jbo: lo pendo be mi bebna

source: I knew I'd forgotten something.
jbo: mi pu sanji lo nu pu tolmo'i zo'e

source: I'd like some plum jam.
jbo: .auo flaume pesxu

source: Beetroot was offered to Apollo in his temple at Delphi.
jbo: lo betka zei genja pu se friti fi la apolon bu'u lo malsi be ri bei la delfis

source: I've eaten the borsch.
jbo: mi mo'u citka lo betka genja stasu

source: I'm a cat.
jbo: mi mlatu

source: Uri Avnery visited Yassir Arafat for the first time in 1982.
jbo: la .uris.avneris. pu paroi vitke la iasir.arafat. de'i lo nanca be li pasobire

source: We are from Russia.
jbo: mi'ai se krasi la rosias

source: Has anyone here in the classroom heard about Norman Finkelstein?
jbo: xu da poi vi zvati lo tadni kumfa cu ba'o tirna la norman.finkelctain.

source: I'm grateful to him for catching my hat that I lost on the windy street.
jbo: mi ckire ko'a lo ka kavbu lo pe mi mapku poi mi pu cirko bu'u lo brife klaji

source: She offered me some marmalade.
jbo: pu friti lo najnimre pesxu mi

source: He offered me some orange jam.
jbo: pu friti lo najnimre pesxu mi

source: No man is a prophet in his own country.
jbo: no prenu cu censa bu'u lo gugde be vo'a

source: Every new language is like a game.
jbo: ro cnino bangu ku jai simsa lo nu kelci

source: I didn't shoot anyone.
jbo: u'unai mi cecla no prenu

source: Did anybody see you?
jbo: xu da pu viska do

source: Does anybody need anything?
jbo: xu da de nitcu

source: I'm trying to hold it!
jbo: .a'i mi ze'a ba ralte

source: It'll be hard for me to wake you up.
jbo: .a'i mi ba gasnu lo nu do cikna binxo

source: Ah, this is easy.
jbo: .a'i cu'i ti frili

source: Nah, why bother fixing it.
jbo: .a'i nai cikre ta

source: I intend to live forever.
jbo: .ai mi ze'e ba jmive

source: I don't know whether I'll purchase these or not.
jbo: .ai cu'i mi ti ba te vecnu

source: I'm not planning to work on Monday.
jbo: .ai nai mi gunka ca lo pavdei

source: I don't mean to add words of my own devising.
jbo: .ai nai mi jmina lo valsi poi mi finti

source: I didn't mean for you to get hurt.
jbo: .ai nai do pu se xrani

source: Would that the trees might speak on behalf of all things that have roots, and punish those that wrong them!
jbo: .au lo tricu cu krati lo ro se genja gije sfasa lo kusru be gy

source: I don't really care who wins.
jbo: .au cu'i makau jinga

source: I'm reluctant to leave.
jbo: .au nai mi cliva

source: Oh, that the Lord would guide my ways.
jbo: .a'o lo nobli cu gidva lo se zukte be mi

source: Everything will be lost now.
jbo: .a'o nai ro da ca se cirko

source: I'm hopeless!
jbo: .a'o nai

source: Gotta go now, bye!
jbo: .ei mi cliva co'o

source: I should go now. Bye!
jbo: .ei mi cliva co'o

source: The president ought to be ashamed.
jbo: .ei lo jatna cu ckeji

source: You ought to know.
jbo: .ei do djuno

source: You don't have to feel threatened.
jbo: .ei nai do tolnurcni

source: You may sit down.
jbo: .e'a do tsebi'o

source: Show them what you can do! Go for it!
jbo: .e'e ko jarco lo se kakne be do

source: I'll race you to the car!
jbo: .e'e mi do bajra jivna fe'e co'u le karce

source: Sorry, I have other things to do.
jbo: .e'e nai mi bilga lo nu zukte lo drata

source: Give that to me!
jbo: .e'i ko ta mi dunda

source: Do whatever you please!
jbo: .e'i nai ko zukte lo se djica be do

source: Here, have some candy.
jbo: .e'o nai ko lebna lo titla

source: You better not open your mouth.
jbo: .e'u nai do kargau le moklu

source: Indeed God exists.
jbo: ia lo cevni cu zasti

source: Hmm ... God may or may not exist.
jbo: ia cu'i lo cevni cu zasti

source: I don't believe God exists.
jbo: ia nai lo cevni cu zasti

source: Yes, that's beautiful.
jbo: ie ta melbi

source: I disagree with that.
jbo: ie nai go'i

source: I have to go now. Bye!
jbo: e'i mi ca cliva co'o

source: Aha, go on, what happened next?
jbo: .a'a .i ko di'a co'e .i ba ku ma fasnu

source: Eh, just a second, let me finish this.
jbo: .a'a cu'i ko denpa lo nu mi mulgau ti

source: La, la, la, I'm not listening.
jbo: .a'a nai mi na tirna

source: Today is going to be a good day!
jbo: .a'e lo cabdei ba xamgu djedi

source: Yaaaawn... I'm going to bed.
jbo: .a'e nai mi klama lo ckana

source: That's none of my business.
jbo: .a'u cu'i na cuntu mi
